#ifndef __OLED_H__
#define __OLED_H__

#include "stm32f10x.h"

/**************************************************************************
函 数 名:OLED_Display_On
功能描述:开启OLED显示 
输入参数:None
输出参数:None
返 回 值:None
其他说明:
**************************************************************************/
void OLED_Display_On(void);

/**************************************************************************
函 数 名:OLED_Display_Off
功能描述:关闭OLED显示 
输入参数:None
输出参数:None
返 回 值:None
其他说明:
**************************************************************************/  
void OLED_Display_Off(void);

/**************************************************************************
函 数 名:OLED_Clear
功能描述:清屏函数
输入参数:None
输出参数:None
返 回 值:None
其他说明:
**************************************************************************/  	  
void OLED_Clear(void);

/**************************************************************************
函 数 名:OLED_Init
功能描述:OLED初始化
输入参数:None
输出参数:None
返 回 值:None
其他说明:
**************************************************************************/
void OLED_Init( void );

/**************************************************************************
函 数 名:OLED_ShowString
功能描述:显示字符串
输入参数:
@x,y:起点坐标 
@y:0~63
@p:字符串起始地址
@size:选择字体 12/16/24
输出参数:None
返 回 值:None
其他说明:
**************************************************************************/
void OLED_ShowString(uint8_t x, uint8_t y, const char *p, uint8_t size);

#endif
