/***************************************************************************************
*Copyright (c) 2019 - ,
*文 件 名:systick.h
*作    者:赵光鑫
*联系方式:zhao.guangxin@qq.com
*创建日期:2019-9-7
*说    明:				
*修    改:

***************************************************************************************/
#ifndef __SYSTICK_H
#define __SYSTICK_H

#include "stm32f10x.h"


/**************************************************************************
函 数 名:SysTick_Init
功能描述:初始化systick。
输入参数:None
输出参数:None
返 回 值:None
其他说明:
**************************************************************************/
void SysTick_Init(void);

/**************************************************************************
函 数 名:Clock_Init
功能描述:初始化时钟。
输入参数:None
输出参数:None
返 回 值:None
其他说明:
**************************************************************************/
void Clock_Init(void);

#endif
